src/Catalogs/ММ_ШаблоныСообщений/ММ_ШаблоныСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ММ_ШаблоныСообщений</name>
  <attributes>
    <name>ТекстШаблонаTelegram</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаОтправкиEmail</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидШаблона</name>
    <type>
      <types>CatalogRef.ММ_ВидыШаблоновОтправкиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыСообщения</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПараметра</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ММ_ШаблоныСообщений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПолеHTMLДокумента = "<!DOCTYPE html>
						|<html lang='ru'>
						|<head>
						| <meta charset='utf-8'>
						|  <meta http-equiv='X-UA-Compatible' content='IE=edge'>
						| </head>
						|
						| <body>" + Объект.ТекстШаблонаОтправкиEmail + "</body>
																	   |
																	   |</html>";
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТекстШаблонаОтправкиEmailПриИзменении(Элемент)

	ПолеHTMLДокумента = "<!DOCTYPE html>
						|<html lang='ru'>
						|<head>
						| <meta charset='utf-8'>
						|  <meta http-equiv='X-UA-Compatible' content='IE=edge'>
						| </head>
						|
						| <body>" + Объект.ТекстШаблонаОтправкиEmail + "</body>
																	   |
																	   |</html>";

КонецПроцедуры

&НаКлиенте
Процедура ПланируемаяРаботаПриИзменении(Элемент)
	ПланируемаяРаботаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПланируемаяРаботаПриИзмененииНаСервере()

	Объект.ПараметрыСообщения.Очистить();

	Если ЗначениеЗаполнено(Объект.ВидШаблона) Тогда
		ПараметрыОтправки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидШаблона, "ПараметрыОтправки");
		Объект.ПараметрыСообщения.Загрузить(ПараметрыОтправки.Выгрузить());
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
